export const nameRegExp =
  /^([А-ЯA-Z]|[А-ЯA-Z][\x27а-яa-z]{1,}|[А-ЯA-Z][\x27а-яa-z]{1,}\-([А-ЯA-Z][\x27а-яa-z]{1,}|(оглы)|(кызы)|(улы)|(уулу)|(гызы)|(угли)))\040([А-ЯA-Z][\x27а-яa-z]{1,}|[А-ЯA-Z][\x27а-яa-z]{1,}(\-|\s)([А-ЯA-Z][\x27а-яa-z]{1,}|(оглы)|(кызы)|(улы)|(уулу)|(гызы)|(угли)))((\040[А-ЯA-Z][\x27а-яa-z]{1,})|(\040[А-ЯA-Z][\x27а-яa-z]{1,}(\-|\s)([А-ЯA-Z][\x27а-яa-z]{1,}|(оглы)|(кызы)|(улы)|(уулу)|(гызы)|(угли))))?$/;
export const phoneRegExp =
  /^((8|\+7)[\- ]?)?(\(?\d{3}\)?[\- ]?)?[\d\- ]{7,10}?$/;
export const emailRegExp =
  /^(([0-9A-Za-z]{1}[-0-9A-z\.]{1,}[0-9A-Za-z]{1})@([-A-Za-z0-9]{1,}\.){1,2}[-A-Za-z]{2,})$/;
